nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.h
/*
 * Copyright 2023-2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_PM_DEVICE_H_
#define _FSL_PM_DEVICE_H_

#include "fsl_common.h"

#include "fsl_pm_config.h"

/*!
 * @addtogroup PM Framework: Power Manager Framework
 * @brief This section includes Power Mode macros, System Constraints macros, and Wakeup source macros.
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*!
 * @name Power Mode Definition
 * @{
 */

/* Power Mode Index */
#define PM_LP_STATE_SLEEP              (0U)
#define PM_LP_STATE_DEEP_SLEEP         (1U)
#define PM_LP_STATE_POWER_DOWN_WAKE_DS (2U)
#define PM_LP_STATE_POWER_DOWN_WAKE_PD (3U)
#define PM_LP_STATE_DEEP_POWER_DOWN    (4U)
#define PM_LP_STATE_VBAT               (5U)
#define PM_LP_STATE_NO_CONSTRAINT      (0xFFU)

/* Give alias for simplified Power Down Mode */
#define PM_LP_STATE_POWER_DOWN PM_LP_STATE_POWER_DOWN_WAKE_PD

/*! @} */

/*! @brief Helper macros
 * @{
 */
#define PM_RESC_MASK(resc_masks, rescIndex) (((resc_masks)->rescMask[(rescIndex) / 32UL] >> ((rescIndex) % 32UL)) & 1UL)
#define PM_RESC_GROUP(resc_groups, rescIndex) \
    ((resc_groups)->groupSlice[(rescIndex) / 8UL] >> (4UL * ((rescIndex) % 8UL))) & 0xFUL
#define PM_RESOURCE_DB_COUNT (sizeof(resourceDB) / sizeof(*resourceDB))
/*! @} */

/*! @brief Available constraints for resources
 * @{
 */

typedef enum _resc_name
{
    kResc_BUS_SYS_Clk, /*!<    Bus/System Clocks */
    kResc_CORE_WAKE,   /*!<    CORE_WAKE Domain */

    /* These SRAM rescs must remain in this order */
    kResc_SRAM_RAMA0_8K,      /*!<    RAMA0 SRAM */
    kResc_SRAM_RAMA1_8K,      /*!<    RAMA1 SRAM */
    kResc_SRAM_RAMA2_8K,      /*!<    RAMA2 SRAM */
    kResc_SRAM_RAMA3_8K,      /*!<    RAMA3 SRAM */
    kResc_SRAM_RAMX0_32K,     /*!<    RAMX0 SRAM */
    kResc_SRAM_RAMX1_32K,     /*!<    RAMX1 SRAM */
    kResc_SRAM_RAMX2_32K,     /*!<    RAMX2 SRAM */
    kResc_SRAM_RAMB0_32K,     /*!<    RAMB0 SRAM */
    kResc_SRAM_RAMC0_32K,     /*!<    RAMC0 SRAM */
    kResc_SRAM_RAMC1_32K,     /*!<    RAMC1 SRAM */
    kResc_SRAM_RAMD0_32K,     /*!<    RAMD0 SRAM */
    kResc_SRAM_RAMD1_32K,     /*!<    RAMD1 SRAM */
    kResc_SRAM_RAME0_32K,     /*!<    RAME0 SRAM */
    kResc_SRAM_RAME1_32K,     /*!<    RAME1 SRAM */
    kResc_SRAM_RAMF0_32K,     /*!<    RAMF0 SRAM */
    kResc_SRAM_RAMF1_32K,     /*!<    RAMF1 SRAM */
    kResc_SRAM_RAMG01_32K,    /*!<    RAMG0/1 SRAM */
    kResc_SRAM_RAMG23_32K,    /*!<    RAMG2/3 SRAM */
    kResc_SRAM_RAMH01_32K,    /*!<    RAMH0/1 SRAM */
    kResc_SRAM_LPCAC,         /*!<    LPCAC SRAM */
    kResc_SRAM_DMA_PKC,       /*!<    DMA_PKC SRAM */
    kResc_SRAM_USB0,          /*!<    USB0 SRAM */
    kResc_SRAM_PQ,            /*!<    PQ SRAM */
    kResc_SRAM_CAN_ENET_USB1, /*!<    CAN/ENET/USB1 SRAM */
    kResc_SRAM_FLEXSPI0,      /*!<    FLEXSPI0 SRAM */

    kResc_Flash,              /*!<    Flash Memory */
    kResc_DCDC_CORE,          /*!<    DCDC_CORE Regulator */
    kResc_LDO_CORE,           /*!<    LDO_CORE Regulator */
    kResc_LDO_SYS,            /*!<    LDO_SYS Regulator */
    kResc_FRO_144M,           /*!< 31 Internal 144 MHz Oscillator */
    kResc_FRO_12M,            /*!< 32 Internal  12 MHz Oscillator */
    kResc_FRO_16K,            /*!<    Internal  16 kHz Oscillator */
    kResc_OSC_RTC,            /*!<    32 kHz Crystal Oscillator */
    kResc_OSC_SYS,            /*!<    High-Frequency Crystal Oscillator */
    kResc_PLL0,               /*!<    Auxillary APLL */
    kResc_PLL1,               /*!<    System SPLL */
    kResc_VREF,               /*!<    VREF peripheral */
    kResc_USB3V_DET,          /*!<    USB 3V Detect */
    kResc_DAC0,               /*!<    DAC0 peripheral */
    kResc_DAC1,               /*!<    DAC1 peripheral */
    kResc_DAC2,               /*!<    DAC2 peripheral */
    kResc_OPAMP0,             /*!<    OPAMP0 peripheral */
    kResc_OPAMP1,             /*!<    OPAMP1 peripheral */
    kResc_OPAMP2,             /*!<    OPAMP2 peripheral */
    kResc_CMP0,               /*!<    CMP0 peripheral */
    kResc_CMP1,               /*!<    CMP1 peripheral */
    kResc_CMP2,               /*!<    CMP2 peripheral */
    kResc_ADC,                /*!<    ADC peripheral */
    kResc_SINC,               /*!<    SINC Filter peripheral */
    kResc_BG_CORE,            /*!<    VDD_CORE Bandgap */
    kResc_BG_VBAT,            /*!<    VBAT Bandgap */
    kResc_GDET,               /*!<    VDD_CORE Glitch Detect */
    kResc_HVD_CORE,           /*!<    VDD_CORE HVD */
    kResc_HVD_SYS,            /*!<    VDD_SYS HVD */
    kResc_HVD_IO,             /*!<    VDD IO HVD */
    kResc_LVD_CORE,           /*!<    VDD_CORE LVD */
    kResc_LVD_SYS,            /*!<    VDD_SYS LVD */
    kResc_LVD_IO,             /*!<    VDD IO LVD */
    kResc_IO_Det,             /*!<    VDD IO voltage detect */
    kResc_Max_Num             /*!< 61 Maximum Number of Resource Constraints */
} resc_name_t;

/* Helper macros for Resource Contraint Masks */
#define PM_MASK_RESC_RAMA                                                                         \
    ((1UL << kResc_SRAM_RAMA0_8K) | (1UL << kResc_SRAM_RAMA1_8K) | (1UL << kResc_SRAM_RAMA2_8K) | \
     (1UL << kResc_SRAM_RAMA3_8K))

#define PM_MASK_RESC_RAMS                                                                                          \
    ((1UL << kResc_SRAM_RAMX0_32K) | (1UL << kResc_SRAM_RAMX1_32K) | (1UL << kResc_SRAM_RAMX2_32K) |               \
     (1UL << kResc_SRAM_RAMB0_32K) | (1UL << kResc_SRAM_RAMC0_32K) | (1UL << kResc_SRAM_RAMC1_32K) |               \
     (1UL << kResc_SRAM_RAMD0_32K) | (1UL << kResc_SRAM_RAMD1_32K) | (1UL << kResc_SRAM_RAME0_32K) |               \
     (1UL << kResc_SRAM_RAME1_32K) | (1UL << kResc_SRAM_RAMF0_32K) | (1UL << kResc_SRAM_RAMF1_32K) |               \
     (1UL << kResc_SRAM_RAMG01_32K) | (1UL << kResc_SRAM_RAMG23_32K) | (1UL << kResc_SRAM_RAMH01_32K) |            \
     (1UL << kResc_SRAM_LPCAC) | (1UL << kResc_SRAM_DMA_PKC) | (1UL << kResc_SRAM_USB0) | (1UL << kResc_SRAM_PQ) | \
     (1UL << kResc_SRAM_CAN_ENET_USB1) | (1UL << kResc_SRAM_FLEXSPI0) | PM_MASK_RESC_RAMA)

/* VBAT */
#define PM_MASK_RESC_LOWEST_VBAT0 PM_MASK_RESC_RAMA
#define PM_MASK_RESC_LOWEST_VBAT1 \
    ((1UL << (kResc_FRO_16K - 32)) | (1UL << (kResc_OSC_RTC - 32)) | (1UL << (kResc_BG_VBAT - 32)))

/* Deep power down */
#define PM_MASK_RESC_LOWEST_DPD0 ((1UL << kResc_LDO_SYS) | PM_MASK_RESC_LOWEST_VBAT0)
#define PM_MASK_RESC_LOWEST_DPD1                                                               \
    ((1UL << (kResc_CMP0 - 32)) | (1UL << (kResc_CMP1 - 32)) | (1UL << (kResc_HVD_SYS - 32)) | \
     (1UL << (kResc_LVD_SYS - 32)) | PM_MASK_RESC_LOWEST_VBAT1)

