nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.h
#define PM_RESC_RAMF1_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMF1_32K)
#define PM_RESC_RAMF1_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMF1_32K)
#define PM_RESC_RAMF1_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMF1_32K)

#define PM_RESC_RAMG01_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMG01_32K)
#define PM_RESC_RAMG01_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMG01_32K)
#define PM_RESC_RAMG01_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMG01_32K)

#define PM_RESC_RAMG23_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMG23_32K)
#define PM_RESC_RAMG23_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMG23_32K)
#define PM_RESC_RAMG23_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMG23_32K)

#define PM_RESC_RAMH01_32K_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_RAMH01_32K)
#define PM_RESC_RAMH01_32K_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_RAMH01_32K)
#define PM_RESC_RAMH01_32K_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_RAMH01_32K)

#define PM_RESC_RAM_LPCAC_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_LPCAC)
#define PM_RESC_RAM_LPCAC_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_LPCAC)
#define PM_RESC_RAM_LPCAC_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_LPCAC)

#define PM_RESC_RAM_DMA_PKC_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_DMA_PKC)
#define PM_RESC_RAM_DMA_PKC_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_DMA_PKC)
#define PM_RESC_RAM_DMA_PKC_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_DMA_PKC)

#define PM_RESC_RAM_USB0_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_USB0)
#define PM_RESC_RAM_USB0_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_USB0)
#define PM_RESC_RAM_USB0_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_USB0)

#define PM_RESC_RAM_PQ_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_PQ)
#define PM_RESC_RAM_PQ_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_PQ)
#define PM_RESC_RAM_PQ_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_PQ)

#define PM_RESC_RAM_CAN_ENET_USB1_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_CAN_ENET_USB1)
#define PM_RESC_RAM_CAN_ENET_USB1_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_CAN_ENET_USB1)
#define PM_RESC_RAM_CAN_ENET_USB1_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_CAN_ENET_USB1)

#define PM_RESC_RAM_FLEXSPI0_ACTIVE   PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SRAM_FLEXSPI0)
#define PM_RESC_RAM_FLEXSPI0_RETAINED PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_SRAM_FLEXSPI0)
#define PM_RESC_RAM_FLEXSPI0_POWEROFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SRAM_FLEXSPI0)

/*!
 * @brief Set the constraints that the Flash can be Active or Low-Power modes.
 *
 * The internal flash memory can enter low-power mode when the overall chip is in these mode:
 * 1. Active mode, under software control (FLASHCR[FLASHDIS])
 * 2. Sleep mode, optionally (FLASHCR[FLASHDOZE])
 */
#define PM_RESC_FLASH_ACTIVE PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_Flash)
#define PM_RESC_FLASH_LP     PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_Flash)

/*!
 * @brief Set the constraints for the regulators' drive strength modes.
 */
#define PM_RESC_DCDC_CORE_DS_NORMAL PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DCDC_CORE)
#define PM_RESC_DCDC_CORE_DS_LOW    PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON2, kResc_DCDC_CORE)

#define PM_RESC_LDO_CORE_DS_NORMAL PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LDO_CORE)
#define PM_RESC_LDO_CORE_DS_LOW    PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_LDO_CORE)

#define PM_RESC_LDO_SYS_DS_NORMAL PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_LDO_SYS)
#define PM_RESC_LDO_SYS_DS_LOW    PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_LDO_SYS)

/*!
 * @brief Set the constraints for the VDD_CORE BandGap modes.
 */
#define PM_RESC_CORE_BG_ON_BUF_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_BG_CORE)
#define PM_RESC_CORE_BG_ON_BUF_OFF PM_ENCODE_RESC(PM_RESOURCE_PARTABLE_ON1, kResc_BG_CORE)

/*!
 * @brief Set the constraints for the remaining peripherals/features that are On or Off.
 */
#define PM_RESC_FRO_144M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_FRO_144M)
#define PM_RESC_FRO_144M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_FRO_144M)

#define PM_RESC_FRO_12M_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_FRO_12M)
#define PM_RESC_FRO_12M_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_FRO_12M)

#define PM_RESC_FRO_16K_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_FRO_16K)
#define PM_RESC_FRO_16K_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_FRO_16K)

#define PM_RESC_OSC_RTC_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_RTC)
#define PM_RESC_OSC_RTC_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_RTC)

#define PM_RESC_OSC_SYS_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OSC_SYS)
#define PM_RESC_OSC_SYS_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OSC_SYS)

#define PM_RESC_PLL0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_PLL0)
#define PM_RESC_PLL0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_PLL0)

#define PM_RESC_PLL1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_PLL1)
#define PM_RESC_PLL1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_PLL1)

#define PM_RESC_ADC_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_ADC)
#define PM_RESC_ADC_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_ADC)

#define PM_RESC_CMP0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_CMP0)
#define PM_RESC_CMP0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_CMP0)

#define PM_RESC_CMP1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_CMP1)
#define PM_RESC_CMP1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_CMP1)

#define PM_RESC_CMP2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_CMP2)
#define PM_RESC_CMP2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_CMP2)

#define PM_RESC_DAC0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DAC0)
#define PM_RESC_DAC0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_DAC0)

#define PM_RESC_DAC1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DAC1)
#define PM_RESC_DAC1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_DAC1)

#define PM_RESC_DAC2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_DAC2)
#define PM_RESC_DAC2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_DAC2)

#define PM_RESC_OPAMP0_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OPAMP0)
#define PM_RESC_OPAMP0_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OPAMP0)

#define PM_RESC_OPAMP1_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OPAMP1)
#define PM_RESC_OPAMP1_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OPAMP1)

#define PM_RESC_OPAMP2_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_OPAMP2)
#define PM_RESC_OPAMP2_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_OPAMP2)

#define PM_RESC_VREF_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_VREF)
#define PM_RESC_VREF_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_VREF)

#define PM_RESC_SINC_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_SINC)
#define PM_RESC_SINC_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_SINC)

#define PM_RESC_USB3V_DET_ON  PM_ENCODE_RESC(PM_RESOURCE_FULL_ON, kResc_USB3V_DET)
#define PM_RESC_USB3V_DET_OFF PM_ENCODE_RESC(PM_RESOURCE_OFF, kResc_USB3V_DET)

