nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.h
#define PM_WSID_P1_7_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_8, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_7_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_8, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_7_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_8, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_8_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_11, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_8_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_11, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_8_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_11, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_11_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_12, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_11_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_12, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_11_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_12, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_12_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_15, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_12_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_15, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_12_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_15, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_15_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_16, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_15_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_16, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_15_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_16, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_16_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_19, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_16_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_19, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_16_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P1_19, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P1_19_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_2, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P1_19_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_2, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P1_19_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_2, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P2_2_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_4, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P2_2_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_4, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P2_2_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P2_4, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P2_4_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_0, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P2_4_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_0, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P2_4_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_0, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P4_0_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_3, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P4_0_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_3, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P4_0_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_3, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P4_12_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_12, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P4_12_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_12, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P4_12_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_12, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P4_15_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_15, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P4_15_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_15, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P4_15_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P4_15, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P3_0_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_0, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_0_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_0, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_0_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_0, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

#define PM_WSID_P3_8_RISING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_8, PORT_EFT_IRQn, kWup_pinDet_RisingEdge)
#define PM_WSID_P3_8_FALLING_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_8, PORT_EFT_IRQn, kWup_pinDet_FallingEdge)
#define PM_WSID_P3_8_ANY_EDGE \
    PM_ENCODE_WAKEUP_SOURCE_ID(kWup_inputType_extPin, kWup_pinID_P3_8, PORT_EFT_IRQn, kWup_pinDet_AnyChange)

